
**Summary previous Lecture**<br>
NumPy's ndarray data structure provides essential features for the type of clean, well-organized data typically seen in numerical computing tasks.

**Limitations of numpy**
 - Cannot attach labels to data,
 - lacks flexibility to working with missing data
 - lacks flexibility to do operations that do not map well to element-wise broadcasting (e.g., groupings, pivots, etc.)
 

# <font color = 'dodgerblue'> **Pandas** </font>

Pandas is an open-source library that is built on top of NumPy library. 

**Why Pandas**
1. It provides an efficient implementation of multidimensional arrays (dataframes) with attached row and column labels.
2. These dataframes often consist of hetrogeneous or missing data.
3. Many of Excel's features, like making pivot tables, calculating columns based on other columns, drawing graphs, etc., can be done prorrammatically. 
4. You can also group rows by the value in a column or join tables together, just like in SQL. 
5. Pandas also does a great job with time series.

## <font color = 'dodgerblue'> **Importing a package** </font>

1. Importing the pandas is similar to importing the numpy package.


2. **Syntax**:



```
      import package_name as alias name
```

In [1]:
# Importing pandas package with alias name as pd
import pandas as pd
import numpy as np

In [2]:
# Checking the version of the pandas
pd.__version__

'1.2.4'

In [3]:
np.__version__

'1.20.1'

# <font color = 'dodgerblue'> **Pandas Objects** </font>
1. In numpy the arrays or matrices were identified by using the indices.
2. Pandas obejcts are enhanced version of numpy where the rows and columns are labeled.
3. The data can be accessed by using these lables for  columns/rows. 
4. These pandas objects are broadly classified as follows:
   * Pandas series object
   * Pandas dataframe object

## <font color = 'dodgerblue'> **Creating Pandas series object** </font>

1. **Pandas Series** is a one dimensional array of indexed data.
2. A series is a wrap of sequence of values and a sequence of indices for the given values.
2. It can be created from list, dictionary etc.
3. **Syntax** :
   

```
      pandas.Series(data, index)
```
where, it can take data as a list, dictionary, tuple etc and index can be defined explicitly.
4. To access the values of the series. We can use following code :
 
  **Syntax** :
```
    d = pandas.Series(data, index)
    d.values
```
values method gives the values of the series without the index.
5. Similarly, we can access the index of the series without accessing the values as follows :

 **Syntax**:

```
    d.index
```

###  <font color = 'dodgerblue'> **Creating series from list** </font>

In [5]:
# Creating series by using list 
list = [12, 0.25, 45, 36, 78, 20]
data1 = pd.Series(list)
print(f"The new pandas series is : \n {data1}")

The new pandas series is :
 0    12.00
1     0.25
2    45.00
3    36.00
4    78.00
5    20.00
dtype: float64

- From the above example, it looks like that series is similar to one dimensional numpy array. The key diffeernce is that we can define the index explicitly in series. 
- Each item in a Series object has something called a "index label" that is a unique name for it. 
- By default, it's just the item's rank in the Series (which starts at 0), but you can set the index labels yourself:

###  <font color = 'dodgerblue'> **Specifying index** </font>

In [6]:
data1 = pd.Series([12, 0.25, 45, 36, 78, 20],
                  index = ['a', 'b', 'c', 'd', 'e', 'f'])
print(f"The new pandas series is : \n{data1}")

The new pandas series is :
a    12.00
b     0.25
c    45.00
d    36.00
e    78.00
f    20.00
dtype: float64

We can think of series as specialized dictionaries. We can infact construct series from dictionaries.

###  <font color = 'dodgerblue'> **Creating series from dictionary** </font>

In [7]:
# first lets create a dictionary
data2 = { 'a':'Pandas', 'b':'numpy', 'c' :'Packages', 'd':'Data processing'}
# Lets pass this dictionary as a series
my_dict_series = pd.Series(data2)
print(f"The series using dictionary is :\n{my_dict_series}")

The series using dictionary is :
a             Pandas
b              numpy
c           Packages
d    Data processing
dtype: object

###  <font color = 'dodgerblue'> **Series Vs. Dictionary** </font>

However, unlike dictionaries, we can do array like operations (for example slicing on series).

In [8]:
slice_dict = data2['a':'c']
print(f'Slice of dictionary : {slice_dict}')

TypeError: unhashable type: 'slice'

In [9]:
slice_series = my_dict_series['a':'c']
print(f'Slice of dictionary :\n{slice_series}')

Slice of dictionary :
a      Pandas
b       numpy
c    Packages
dtype: object

###  <font color = 'dodgerblue'> **Creating series using tuple** </font>

In [10]:
tup = (20, 15, 23, 45)
pd.Series(tup)

0    20
1    15
2    23
3    45
dtype: int64

##  <font color = 'dodgerblue'>  **Creating Pandas Dataframe object**

We can think of Dataframe as two dimensional array with both flexible row indices and flexible column names.

 **Syntax** :


```
    pandas.DataFrame(data, index, columns, dtype)
```
where, 

  **data** = ndarray, Iterable like list, dict, or DataFrame.

 **Index** =
      Index to use for resulting dataframe. By default, it's just the item's rank (strating from 0)  if no index data is provided. We can think of this as row labels.

  **columns** = They are used to mention the columns labels. By default, it's just the item's rank (strating from 0)  if no labels are provided.

Pandas dataframe object can be created in various ways as follows :

<img src="https://drive.google.com/uc?export=view&id=1dsXSMVZ2PoiNo0Kr8KK8eOkeBTZQNby-" width="600"/>

####  <font color = 'dodgerblue'>  **Creating dataframe using a single series object**

* A dataframe is a collection of series obejcts.
* A single column dataframe can be created using  a single series.

In [13]:
# Craeting dataframe using a single series object
countries = pd.Series(['India', 'China', 'Austria', 'America', 'Australia'])
# creating a dataframe by using column labelling
dt = pd.DataFrame(data = countries, columns = ['countries'])
print(f"The dataframe using a single series object is \n {dt}")

The dataframe using a single series object is
    countries
0      India
1      China
2    Austria
3    America
4  Australia

####  <font color = 'dodgerblue'>  **Creating dataframe using numpy array**

* Let's take a two dimensional array of data.
* We can create a dataframe by specifying the columns and index names.
* If we do not specify the columns and index names then it will take the integer index for them.

In [14]:
# Creating dataframe using numpy array
# Lets import the numpy for creating array
import numpy as np
# Creating arrays by using numpy
# rows = 4 ,columns = 5
my_arr = np.random.rand(4, 5)
# lets create the dataframe using array, column labels, and index for the given array
dt1 = pd.DataFrame(data = my_arr , columns = ['var1', 'var2', 'var3', 'var4', 'var5'], index = ['a', 'b', 'c', 'd'])
print(f"The dataframe created by using arrays is : \n {dt1}")

The dataframe created by using arrays is :
        var1      var2      var3      var4      var5
a  0.280407  0.992556  0.588967  0.288681  0.147913
b  0.941788  0.822421  0.076751  0.279819  0.822899
c  0.210664  0.009351  0.252567  0.840051  0.951342
d  0.826243  0.542393  0.071074  0.201902  0.763102

In [15]:
# As we can see below, If we do not specify the columns and index names 
# then it will take the integer index for them.
dt1 = pd.DataFrame(data = my_arr)
print(f"The dataframe created by using arrays is : \n {dt1}")

The dataframe created by using arrays is :
           0         1         2         3         4
0  0.280407  0.992556  0.588967  0.288681  0.147913
1  0.941788  0.822421  0.076751  0.279819  0.822899
2  0.210664  0.009351  0.252567  0.840051  0.951342
3  0.826243  0.542393  0.071074  0.201902  0.763102

####  <font color = 'dodgerblue'> **Creating a dataframe using list**

A dataframe can be created using a single list or lists.

  **Syntax**:


```
  pandas.DataFrame()
```
We can pass the list or lists .

In [16]:
# Creating dataframe using lists

my_list = [14, 25, 36, 89, 12, 45]
dt = pd.DataFrame(my_list)

# We can observe that the column name is considered as 0
print(f"The dataframe using list without specifying column names\n {dt}")

# Giving column label 
dt1 = pd.DataFrame(data = my_list, columns =['Marks'])
print(f"\nThe new dataframe using the column name as Marks is: \n{dt1}")

The dataframe using list without specifying column names
     0
0  14
1  25
2  36
3  89
4  12
5  45

The new dataframe using the column name as Marks is:
   Marks
0     14
1     25
2     36
3     89
4     12
5     45

####  <font color = 'dodgerblue'> **Creating DataFrame from dict of ndarray/lists:**
While creating dataframe from the dictionary of ndarray or lists we need to make sure that :
* All arrays must be of same length.
* If index is passed then length of the index must be equal to the length of the array.
* If no index is passed then by default it takes range of the length of the array.
* The key values of the dictionary will be treated as column labels

In [17]:
# Creating dataframe from dict of ndarrays/Lists
# initializing the data of list
my_arr = {'col1' :[10, 45, 26, 36, 78, 46],
          'col2' :['anu', 'alex', 'apex', 'ho', 'hi', 'bye']
          }
dt_frame = pd.DataFrame(data = my_arr)
print(f"the new dataframe is \n {dt_frame}")

the new dataframe is
    col1  col2
0    10   anu
1    45  alex
2    26  apex
3    36    ho
4    78    hi
5    46   bye

####  <font color = 'dodgerblue'> **Creating a dataframe using a list of dictionary**
* Previously, we have covered the dictionaries using list. 
*  Now, let us consider the dictionaries inside the list or we can say list consisting of dictionaries.

**Example** :

my_list = [{1 : 'hi', 2 : 'c'}]

Here, my_list consist of a dictionary

In [18]:
# Creating a dataframe using a list of dictionary
# First lets create a list consisting of dictionary
my_list = [{1:'pandas', 2:'numpy', 3:'scipy', 4:'data science'},
          {1:'Amazon', 2:'Google', 3:'IBM', 4:'TalkValley'}]
# lets create a dataframe using list
# The columns are labelled using keys
# We can specify index for row labelling
my_dt = pd.DataFrame(data = my_list, index = ['Languages :','Companies :'])
print(f'The dataframe using a list of dictionary is :\n {my_dt}')

The dataframe using a list of dictionary is :
                   1       2      3             4
Languages :  pandas   numpy  scipy  data science
Companies :  Amazon  Google    IBM    TalkValley

#  <font color = 'dodgerblue'> **Data indexing and selection**
* In numpy we used slicing, indexing etc. in order to get sub-arrays.
*  We wanted to access these sub-arrays to make easy modifications or operations.
* Similarly, we can access and modify values in pandas series and dataframe objects.

##  <font color = 'dodgerblue'> **Data selection in series**
We can think of a ``Series`` object as a standard Python dictionary or a one-dimensional NumPy array and we use similar ideas to select subset in series as well.

###  <font color = 'dodgerblue'> **Series as dictionary**
* Like a dictionary, even the series object provides a mapping from a collection of keys to a collection of values.
* We can also use series just like dictionary to examine the keys/indices and values.
* We can also modify the values of the series just like a dictionary.
Following examples will give a clear description about the topic.

In [42]:
import pandas as pd
# Lets create a series 
my_ser = pd.Series([0.25, 10, 45, 26, 78, 36], index = ['first', 'second','third','fourth','fifth','sixth'])
print(f'The dataframe is :\n {my_ser}')

The dataframe is :
 first      0.25
second    10.00
third     45.00
fourth    26.00
fifth     78.00
sixth     36.00
dtype: float64

In [43]:
# We can access the values just by using index values
my_ser['first']

0.25

In [44]:
# We can access the index by using key() method like dictionary
print(f"The index are:\n {my_ser.keys()}")

The index are:
 Index(['first', 'second', 'third', 'fourth', 'fifth', 'sixth'], dtype='object')

In [45]:
# We can also access the values with their keys by using items() method and store them in list
print(f"\nthe values are :\n {list(my_ser.items())}")

TypeError: 'list' object is not callable

In [29]:
# We can check whether a index is present in the series as follows
print(f"\n'third' is present in series: {'third' in my_ser}")

'third' is present in series: True

###  <font color = 'dodgerblue'> **Series as one- dimensional array**
A Series also lets you select items in an array-like way using the same basic methods as NumPy arrays: 

 * slicing
 *  masking 
 * fancy indexing 

We provide the examples below:

#### **Slicing**

**Syntax** :



```
    my_series = pandas.Series()
    sub_series = my_series[start: stop: step]
```

In [46]:
# CCreate a series
my_data = pd.Series([12, 78, 88, 92, 25, 14, 75], index = ['a', 'b', 'c', 'd', 'e', 'f', 'g'])
my_data

a    12
b    78
c    88
d    92
e    25
f    14
g    75
dtype: int64

#####  <font color = 'dodgerblue'>  **Using slicing by explicit index**

In [47]:
# slicing by explicit index
# It will give the data from a to d index
# In explicit/level-based indexing (where we specify the index rather than the position like 0, 1), 
# we get the final index included in the output
# We will get all the values indexed from a to d.
my_data['a' : 'd']

a    12
b    78
c    88
d    92
dtype: int64

#####  <font color = 'dodgerblue'>  **Using slicing by implicit integer index**

In [48]:
# In implicit/integer-based indexing the final index is excluded
# In the example below,  we will get the values indexed from 0 to 2 and the value at index 3 will not be considered
my_data[0 : 3]

a    12
b    78
c    88
dtype: int64

####  <font color = 'dodgerblue'> **Masking**

* Masking allows us to work with the boolean lists.
* When applied to the original data it will return the data corresponding to index for which the vvalue the list is True.

In [49]:
#Lets creat a series of data
my_ser = pd.Series([10, 20, 30, 40, 50, 60, 70, 80])
print(f"My series is \n {my_ser}")

My series is
 0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64

In [50]:
# Sum of elements that meet the condition : 20 > value > 50
# Using for loop to access the data
total = 0
for n in my_ser:
  #Lets use a condition that n should be between 20 and 50
    if (n>20) and (n<50):
        total += n
print(f"the total sum is {total}")

the total sum is 70

In [51]:
# Let's do sum using list comprehension for the same data
sum([n for n in my_ser if (n>20) and (n<50)])

70

In [52]:
# But what if there is more data 
# it will take time for the for loop or list comprehension
# Masking will make it easier for data selection or operations

my_mask = ((my_ser>20) & (my_ser<50))
print(f"If the condition is True, then mask returns True. Otherwise it returns False \n {my_mask}")

If the condition is True, then mask returns True. Otherwise it returns False
 0    False
1    False
2     True
3     True
4    False
5    False
6    False
7    False
dtype: bool

In [53]:
# selected sub array
s = my_ser[my_mask]
print(f'Selected sub array using mask is :\n {s}')

Selected sub array using mask is :
 2    30
3    40
dtype: int64

In [54]:
# Sum of the masked condition is 
s = my_ser[my_mask].sum()
print(f"Therefore, the sum using mask is {s}")

Therefore, the sum using mask is 70

In [55]:
# we can accomplish the above task in one statement

my_ser[(my_ser> 20) & (my_ser<50)].sum()

70

####  <font color = 'dodgerblue'> **Fancy indexing**

* Fancy indexing allows us to pass arrays of indices in place of passing a single index.


  **Syntax** :


```
    data= pandas.Series()
    indices = [3, 2, 5]
    data[indices]
```
where, indices is a list of indices required.
data is the series in pandas which is used to extract the data.

In [56]:
# Fancy indexing

# Lets prepare the list of indices 
ind = ['a', 'e' , 'd']

# Lets pass this list inside the dataframe
my_data[ind]

a    12
e    25
d    92
dtype: int64

###  <font color = 'dodgerblue'> **indexers: loc, iloc**

If we have explicit integer index, slicing and indexing conventions can create confusion.
Let us see an example below:

In [57]:
my_data = pd.Series(['python', 'numpy', 'pandas'], index=[1, 3, 5])
my_data

1    python
3     numpy
5    pandas
dtype: object

In [58]:
# let us see what happens in indexing
my_data[1]

'python'

In [59]:
# let us see what happens in slicing
my_data[1:2]

3    numpy
dtype: object

- So in indexing, it uses explicit index (labels that we passed) and in slicing it uses implicit index (default index of python where first element is indexed as zero)
- To avoid this confusion, we can use loc() method for explicit indexing and iloc method (integer indexing) for implicit indexing

In [60]:
# explicit indexing using loc - get the item where explicit index is 1
my_data.loc[1]

'python'

In [61]:
# implicit indexing using iloc - get the item where implicit indx is 1 (i.e second element)
my_data.iloc[1]

'numpy'


### <font color = 'dodgerblue'> **Summary** : </font>

<font color = 'red'>

1.  Use masking if you want to select data based on condition.
2. Use loc for explicit indexing - if you know the exact row labels
3. Use iloc (integer) for implicit indexing - useful when we do not know the exact lables but know the sequence. For example - we want first five rows, last five rows or we want to iterate over the rows in a for loop. 

</font>

## <font color = 'dodgerblue'> **Data selection in DataFrame** 
There are various ways to select the data from the DataFrame as follows :
 
 * Dataframe as a dictionary
 * Dataframe as two dimensional array

### **DataFrame as a dictionary**
Let's consider DataFrame as a dictionary. Then we can use dictionary way to select the data as follows:

In [62]:
# Let's try to make two series by using dictionary
my_area = pd.Series({1: 12305, 2: 26453, 3: 45789, 4: 12456, 5: 20134})
countries = pd.Series({1: 'India', 2: 'Austria', 3: 'Africa', 4: 'America', 5: 'Sri lanka'})

#Let's convert these series into dataframe
my_dt = pd.DataFrame({'my_area': my_area, 'countries' : countries})
print(f"My dataframe is \n {my_dt}")

My dataframe is
    my_area  countries
1    12305      India
2    26453    Austria
3    45789     Africa
4    12456    America
5    20134  Sri lanka

In [63]:
# We can acess the data by using dictionary-style indexing of the column name
my_dt['my_area']

1    12305
2    26453
3    45789
4    12456
5    20134
Name: my_area, dtype: int64

In [64]:
# We can also use the attribute -style access with column names that are strings
my_dt.countries

1        India
2      Austria
3       Africa
4      America
5    Sri lanka
Name: countries, dtype: object

### <font color = 'dodgerblue'> **Dataframe as two dimensional array**
We can select the data by using following methods for a two dimensional array :
 * values
 * Slicing
 * loc (explicit indexing) is label based where we specify the rows and columns based on  labels of rows and columns
 * iloc (implicit indexing) stands for integer location where we can specify the rows and columns by their integer positional values.

Following examples will give much more insights:

#### <font color = 'dodgerblue'> **Values**

In [65]:
# Lets create the dictionary first
data = {
    'calories' :[425, 500, 482, 369, 289, 563],
    'hours' : [10, 20, 6, 4, 5, 6],
    'sleep' :[6, 6, 8, 8, 7 , 6]
}
# Creating the dataframe

dt = pd.DataFrame(data)
print(f"The dataframe is\n {dt}")

The dataframe is
    calories  hours  sleep
0       425     10      6
1       500     20      6
2       482      6      8
3       369      4      8
4       289      5      7
5       563      6      6

In [66]:
# we can use the values attribute to get the data without column names and index
# this method gives us the data as numpy array
dt.values

array([[425,  10,   6],
       [500,  20,   6],
       [482,   6,   8],
       [369,   4,   8],
       [289,   5,   7],
       [563,   6,   6]], dtype=int64)

In [67]:
# we can see that using values method gives us the numpy array
type(dt.values)

numpy.ndarray

#### <font color = 'dodgerblue'> **Slicing**

In [68]:
# Passing the single index to access a column
dt['calories']

0    425
1    500
2    482
3    369
4    289
5    563
Name: calories, dtype: int64

In [69]:
# let us try slicing with columns
dt['calories':'sleep']

TypeError: cannot do slice indexing on RangeIndex with these indexers [calories] of type str

In [70]:
# let us try using implicit indexing
dt[0:2]

   calories  hours  sleep
0       425     10      6
1       500     20      6

<font color = 'red'> **Slicing Summary** </font>


- <font color = 'aqua'> In Pandas , slicing refers to rows and not columns. Again slicing will use implicit indexng and fetch corresponding rows.

- <font color = 'aqua'> Useful shotcuts - Acces single columns using indexing, for example `df['column name']` and use slicing to access rows `df[0:3]`. 
- <font color = 'aqua'> To avoid confusion, we should use `loc` and `iloc` methods. We can separate rows and columns using comma.

####  <font color = 'dodgerblue'> **indexers: loc, iloc**

In [71]:
# Lets create a dataframe
my_data = {
    'name':['Olivia', 'Emma', 'Ava', 'Sophia', 'Isabella', 'Charlotte'],
    'age' : [12, 15, 13, 14, 17, 19],
    'class':['seventh', 'sixth', 'ninth', 'tenth', 'graduation', 'graduation']
}
dt3 = pd.DataFrame(my_data)
print(f"The dataframe is\n {dt3}\n")

The dataframe is
         name  age       class
0     Olivia   12     seventh
1       Emma   15       sixth
2        Ava   13       ninth
3     Sophia   14       tenth
4   Isabella   17  graduation
5  Charlotte   19  graduation

In [72]:
# Lets use loc method to locate a particular data (first four rows and column 'name' )
# remember in explicit indexing both start and end values are included
dt3.loc[: 3,  'name']

0    Olivia
1      Emma
2       Ava
3    Sophia
Name: name, dtype: object

In [73]:
# now let us get the same data using iloc
# remeber in implicit indexing start value is included but end valus is not included
dt3.iloc[: 4,  0]

0    Olivia
1      Emma
2       Ava
3    Sophia
Name: name, dtype: object

In [74]:
# combine loc with masking
# Get name and age of students whose age is greater than 13 
dt3.loc[dt3.age>13, ['name', 'age']]

        name  age
1       Emma   15
3     Sophia   14
4   Isabella   17
5  Charlotte   19

In [75]:
# combine loc with masking
# Get name and age of students whose age is greater than 13 but less than 17
dt3.loc[(dt3.age>13) & (dt3.age<17), ['name', 'age']]

     name  age
1    Emma   15
3  Sophia   14

# <font color = 'dodgerblue'> **Uses cases** </font>
1. Pandas have a variety of use cases. In this notebook, we will discuss the following:

   * Handling missing values
   * Manupulating data
   * Sorting Data
   * Aggregation of data
   * Grouping data
   * Data summary using Pivot Tables
   * Merging, joining and concatenating data

## <font color = 'dodgerblue'> **Handling missing values** </font>

1. The real world data is not so homogeneous or clean.
2. The data may have missing values or null values.
3. Pandas, helps us to clean our data and make it in a presentable form.
4. Missing data are presented as null, NaN(not a number) or NA values
5. There are several methods for detecting, removing and replacing null values in pandas and they are:
   * isnull()
   * notnull()
   * dropna()
   * fillna()

### <font color = 'dodgerblue'> **Detecting null values**
* isnull() and notnull() are useful for detecting null  values.
* We can get boolean mask for null using isnull() - for null values it will return True otherwise it will return False.
* We can get boolean mask for not null using notnull() - for not null values it will return True otherwise it will return False.

In [76]:
# Lets create a new dataframe

data2 = {
    'name' : ['alex', np.nan, 'ross', np.nan, 'potter', np.nan],
    'age' :  [10, np.nan, 20, 0, np.nan, 25 ]
}

dt2 = pd.DataFrame(data2)
print(f"the dataframe is\n {dt2}")

the dataframe is
      name   age
0    alex  10.0
1     NaN   NaN
2    ross  20.0
3     NaN   0.0
4  potter   NaN
5     NaN  25.0

#### <font color = 'dodgerblue'> **is_null()**

In [77]:
# Detecting null values by using isnull() method
# it will give the boolean mask 
null_mask = dt2.isnull()
print(f' Mask indicating null values:\n{null_mask}')

 Mask indicating null values:
    name    age
0  False  False
1   True   True
2  False  False
3   True  False
4  False   True
5   True  False

In [78]:
# we can count number of null values in each column by using .sum()
print(f' Number of null values:\n{dt2.isnull().sum()}')

 Number of null values:
name    3
age     2
dtype: int64

In [79]:
# Get the percentage of null values in eacvh column
print(f' \nPercentage of null values in each column:\n{100*dt2.isnull().sum()/len(dt2)}')

Percentage of null values in each column:
name    50.000000
age     33.333333
dtype: float64

In [80]:
# we can also get number of null values in each row
print(f' Number of null values in eah row:\n{dt2.isnull().sum(axis =1)}')

 Number of null values in eah row:
0    0
1    2
2    0
3    1
4    1
5    1
dtype: int64

#### <font color = 'dodgerblue'> **not_null()**

In [81]:
# We can access the values which are not null by using notnull() method
# This will create a mask where all the missing values or NaN values are shown as False
# And the non missing values are shown as True
dt2.notnull()

    name    age
0   True   True
1  False  False
2   True   True
3  False   True
4   True  False
5  False   True

### <font color = 'dodgerblue'> **Dropping null values**

dropna() method is used to drop the null values present in the data.

In [82]:
# creating a dataframe
# we can use numpy to create nan values by using np.nan method
data = {
    'columns': [0, 10, 20, np.nan , 0 , 12 , np.nan],
    'rows' : ['first', 'second', 'third', 'fourth', 'fifth', 'sixth', 'seventh']
}
df = pd.DataFrame(data)
print(f"The data frame is \n {df}")

The data frame is
    columns     rows
0      0.0    first
1     10.0   second
2     20.0    third
3      NaN   fourth
4      0.0    fifth
5     12.0    sixth
6      NaN  seventh

In [83]:
# let's drop the NA/Nan values by using dropna()
df.dropna()

   columns    rows
0      0.0   first
1     10.0  second
2     20.0   third
4      0.0   fifth
5     12.0   sixth

###  <font color = 'dodgerblue'> **Filling the null values**
fillna() is used to fill the NA values in the dataframe.

In [84]:
# Consider the dataframe df from the above example
# Replace (fill) Na values with zero

df.fillna(0)

   columns     rows
0      0.0    first
1     10.0   second
2     20.0    third
3      0.0   fourth
4      0.0    fifth
5     12.0    sixth
6      0.0  seventh

In [85]:
# Using the forward fill to take the previous value forward
df.fillna(method='ffill')

   columns     rows
0      0.0    first
1     10.0   second
2     20.0    third
3     20.0   fourth
4      0.0    fifth
5     12.0    sixth
6     12.0  seventh

In [86]:
# Using the back-fill to take the next values backward
# Filling the nan values from the next values
df.fillna(method='bfill')

   columns     rows
0      0.0    first
1     10.0   second
2     20.0    third
3      0.0   fourth
4      0.0    fifth
5     12.0    sixth
6      NaN  seventh

##  <font color = 'dodgerblue'> **Data Manipulation**
We have many different methods to manipulate the data in the pandas. We will discuss some of these below:

###  <font color = 'dodgerblue'> **Adding a new columns to the data**
We can also add new columns to the existing data in pandas.
The example is given as follows:

In [87]:
# Adding new columns to the data
# Let's create a dataframe
data = {
    'name': ['alex', 'ami', 'ross', 'suzan', 'henry'],
    'class' : ['first', 'first', 'second', 'second', 'second'],
    'math_score' : [20, 20, 30, 50, 10],
    'english_score' : [30, 40, 50, 60, 20],
    'gender' :['Male', 'Female', 'Female', 'Female', 'Male']}
    
df1 = pd.DataFrame(data)
print(f"My dataframe is :\n {df1}")

My dataframe is :
     name   class  math_score  english_score  gender
0   alex   first          20             30    Male
1    ami   first          20             40  Female
2   ross  second          30             50  Female
3  suzan  second          50             60  Female
4  henry  second          10             20    Male

In [88]:
# let's create a series consisting of age information of students
age = pd.Series([4, 7, 8, 9, 5])
print(f"The series is :\n {age}")

The series is :
 0    4
1    7
2    8
3    9
4    5
dtype: int64

In [89]:
# add a new column to df1 - using the series age
# the name of the new column should be age
df1['age'] = age

# The modified  dataframe is 
print(f"The modified dataframe is :\n")
df1

The modified dataframe is :

    name   class  math_score  english_score  gender  age
0   alex   first          20             30    Male    4
1    ami   first          20             40  Female    7
2   ross  second          30             50  Female    8
3  suzan  second          50             60  Female    9
4  henry  second          10             20    Male    5

### <font color = 'dodgerblue'> **Modifying Data using index**

In [90]:
# chnage the age of ross to 20
df1.loc[df1.name=='ross','age'] = 20
# The modified  dataframe is 
print(f"The modified dataframe is :\n {df1}")

The modified dataframe is :
     name   class  math_score  english_score  gender  age
0   alex   first          20             30    Male    4
1    ami   first          20             40  Female    7
2   ross  second          30             50  Female   20
3  suzan  second          50             60  Female    9
4  henry  second          10             20    Male    5

### <font color = 'dodgerblue'> **Modifying Data using numpy ufuncs**
Pandas is built over numpy so any NumPy ufunc will work on Pandas Series and DataFrame objects

In [91]:
log_scores = np.log(df1.loc[:, ['math_score', 'english_score']])

In [92]:
log_scores

   math_score  english_score
0    2.995732       3.401197
1    2.995732       3.688879
2    3.401197       3.912023
3    3.912023       4.094345
4    2.302585       2.995732

### <font color = 'dodgerblue'> **Modify/Create columns using apply() function**

* The apply function allows us to apply any function along an axis of the DataFrame.

In [93]:
# Use apply function  to subtract the mean from each column
# the apply function will aply same function to all the rows
# we can use the lambda function to specify the function

df1[['math_score', 'english_score']] = df1[['math_score', 'english_score']].apply(lambda x : (x-x.mean()))

In [94]:
df1

    name   class  math_score  english_score  gender  age
0   alex   first        -6.0          -10.0    Male    4
1    ami   first        -6.0            0.0  Female    7
2   ross  second         4.0           10.0  Female   20
3  suzan  second        24.0           20.0  Female    9
4  henry  second       -16.0          -20.0    Male    5

In [95]:
# create a new datafarme
my_arr = {'review_id' :[10, 45, 26, 36, 78, 46],
          'text' :['MOVIE was good', 'it was AMAZING', 'horible', 'EXCELLENT', 'WIll watch again', 'DO not waste time']
          }
df_review = pd.DataFrame(data = my_arr)
print(f"the new dataframe is \n {df_review}")

the new dataframe is
    review_id               text
0         10     MOVIE was good
1         45     it was AMAZING
2         26            horible
3         36          EXCELLENT
4         78   WIll watch again
5         46  DO not waste time

In [96]:
# use apply function to create a new column with lowercase test

df_review['text_lower'] = df_review['text'].apply(lambda x: x.lower())
df_review

   review_id               text         text_lower
0         10     MOVIE was good     movie was good
1         45     it was AMAZING     it was amazing
2         26            horible            horible
3         36          EXCELLENT          excellent
4         78   WIll watch again   will watch again
5         46  DO not waste time  do not waste time

### <font color = 'dodgerblue'> **Use filter() function to select subset of the data**
Subset the dataframe rows or columns according to the specified index labels.

In [97]:
# select columns by column names
df1.filter(items = ['math_score', 'english_score'])

   math_score  english_score
0        -6.0          -10.0
1        -6.0            0.0
2         4.0           10.0
3        24.0           20.0
4       -16.0          -20.0

In [98]:
# select columns by regular expression
df1.filter(regex = '.*score', axis =1)

   math_score  english_score
0        -6.0          -10.0
1        -6.0            0.0
2         4.0           10.0
3        24.0           20.0
4       -16.0          -20.0

### <font color = 'dodgerblue'> **Modify/create columns using Binary operations**

In [99]:
# add a new column which gives the total score (math score + english score)
df1['total_score'] = df1['math_score'] + df1['english_score']
# The modified  dataframe is 
print(f"The modified dataframe is :\n {df1}")

The modified dataframe is :
     name   class  math_score  english_score  gender  age  total_score
0   alex   first        -6.0          -10.0    Male    4        -16.0
1    ami   first        -6.0            0.0  Female    7         -6.0
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
4  henry  second       -16.0          -20.0    Male    5        -36.0

In [100]:
# we can achieve this using the eval function as well
# eval function can be used to evaluate any matahematical operations
# using dataframe column names
df1['total_score'] = df1.eval('math_score + english_score')

In [101]:
df1

    name   class  math_score  english_score  gender  age  total_score
0   alex   first        -6.0          -10.0    Male    4        -16.0
1    ami   first        -6.0            0.0  Female    7         -6.0
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
4  henry  second       -16.0          -20.0    Male    5        -36.0

In [102]:
# operation between two series with different index
my_ser1 = pd.Series(data = [1, 2, 3, 4], index = ['A', 'B','C', 'D'])
my_ser2 = pd.Series(data = [5, 6, 7, 8], index = ['A', 'B','C', 'F'])

In [103]:
my_ser1.add(my_ser2)

A     6.0
B     8.0
C    10.0
D     NaN
F     NaN
dtype: float64

<font color = 'red'> **Note:** </font>
<font color = 'aqua'>
As we can see from above operation, when we add series or dataframes, Pandas will allign the indices in performing  binary operations. The resulting index will be a union of the two indices.

In [104]:
# Operation with datafarmes/series  of different sizes
# similar to broadcasting in numpy
data = np.arange(12).reshape(3, 4)
df = pd.DataFrame(data = data, columns = ['A', 'B','C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [105]:
# subtracting row from a dataframe
# let us first select a row
row = df.iloc[0, :]
row

A    0
B    1
C    2
D    3
Name: 0, dtype: int32

In [106]:
# For rows, we have  to match the series and dataframes along columns
# hence in sub() we will specify axis = 1
df_row_sub  = df.sub(row, axis=1)
df_row_sub

   A  B  C  D
0  0  0  0  0
1  4  4  4  4
2  8  8  8  8

In [107]:
# subtracting column from a dataframe
# let us select a column first
col = df.iloc[:, 0]
col

0    0
1    4
2    8
Name: A, dtype: int32

In [108]:
# For columns we have  to match the series and dataframes along rows (index)
# hence in sub() we will specify axis = 1
df_col_sub  = df.sub(df.iloc[:, 0], axis=0)
df_col_sub

   A  B  C  D
0  0  1  2  3
1  0  1  2  3
2  0  1  2  3

### <font color = 'dodgerblue'>**Deleting rows/columns**
We can delete the rows/columns by using the drop() method.

**Syntax**:


```
    DataFrame.drop(index,columns, inplace = True/False)
```
* The index is the index of row to be deleted; columns: is used to specify column names to be deleted.

* If we keep inplace value as **True** then the changes will be applied to the dataframe.
* Otherwise it will just create a temporary view of the result.

In [109]:
# Deleting rows/columns
# lets consider the dataframe mentioned above

df1_copy = df1.copy()
print(f"My dataframe is \n {df1_copy}")

My dataframe is
     name   class  math_score  english_score  gender  age  total_score
0   alex   first        -6.0          -10.0    Male    4        -16.0
1    ami   first        -6.0            0.0  Female    7         -6.0
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
4  henry  second       -16.0          -20.0    Male    5        -36.0

In [110]:
# remove second row and column age
df1_copy.drop(index = 1, columns ='age', inplace = True)
print(f"The new dataframe is \n {df1_copy}")

The new dataframe is
     name   class  math_score  english_score  gender  total_score
0   alex   first        -6.0          -10.0    Male        -16.0
2   ross  second         4.0           10.0  Female         14.0
3  suzan  second        24.0           20.0  Female         44.0
4  henry  second       -16.0          -20.0    Male        -36.0

In [111]:
# remove math_score_column
df1_copy.drop( columns ='math_score', inplace = True)
print(f"The new dataframe is \n {df1_copy}")

The new dataframe is
     name   class  english_score  gender  total_score
0   alex   first          -10.0    Male        -16.0
2   ross  second           10.0  Female         14.0
3  suzan  second           20.0  Female         44.0
4  henry  second          -20.0    Male        -36.0

### <font color = 'dodgerblue'> **Truncate a data from before or after some specified index**
We can truncate the data between some specific index and return the required data.

**Syntax** :


```
DataFrame.truncate(before, after, axis)
```
where, we can mention the before or after index to truncate data.

In [112]:
print(f"My dataframe is :\n {df1}")

My dataframe is :
     name   class  math_score  english_score  gender  age  total_score
0   alex   first        -6.0          -10.0    Male    4        -16.0
1    ami   first        -6.0            0.0  Female    7         -6.0
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
4  henry  second       -16.0          -20.0    Male    5        -36.0

In [113]:
# remove first and last rows

df1_trunc = df1.truncate(before = 1, after = 2)
print(f"\n My new dataframe is \n {df1_trunc}")

 My new dataframe is
    name   class  math_score  english_score  gender  age  total_score
1   ami   first        -6.0            0.0  Female    7         -6.0
2  ross  second         4.0           10.0  Female   20         14.0

## <font color = 'dodgerblue'>**Sorting Data**

In [114]:
df1

    name   class  math_score  english_score  gender  age  total_score
0   alex   first        -6.0          -10.0    Male    4        -16.0
1    ami   first        -6.0            0.0  Female    7         -6.0
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
4  henry  second       -16.0          -20.0    Male    5        -36.0

In [115]:
# row sort (based on index)
df1.sort_index(ascending=False, axis =0)

    name   class  math_score  english_score  gender  age  total_score
4  henry  second       -16.0          -20.0    Male    5        -36.0
3  suzan  second        24.0           20.0  Female    9         44.0
2   ross  second         4.0           10.0  Female   20         14.0
1    ami   first        -6.0            0.0  Female    7         -6.0
0   alex   first        -6.0          -10.0    Male    4        -16.0

In [116]:
# column sort (based on column names)
df1.sort_index( axis =1)

   age   class  english_score  gender  math_score   name  total_score
0    4   first          -10.0    Male        -6.0   alex        -16.0
1    7   first            0.0  Female        -6.0    ami         -6.0
2   20  second           10.0  Female         4.0   ross         14.0
3    9  second           20.0  Female        24.0  suzan         44.0
4    5  second          -20.0    Male       -16.0  henry        -36.0

In [117]:
# sort based on values in a column
df1.sort_values(by = 'age', ascending=False, inplace = True)

In [118]:
df1

    name   class  math_score  english_score  gender  age  total_score
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
1    ami   first        -6.0            0.0  Female    7         -6.0
4  henry  second       -16.0          -20.0    Male    5        -36.0
0   alex   first        -6.0          -10.0    Male    4        -16.0

## <font color = 'dodgerblue'> **Aggregation**

* Similar to numpy, we can use aggregate functions in Pandas as well.


<img src = "https://drive.google.com/uc?view=export&id=1DXhiBZlNvBs6-ltdFXSSWwpudXTvMXaV" width ="400" />

###  <font color = 'dodgerblue'> **count()**

In [119]:
# Let us  use the dataframe from the above example
print(f"the dataframe is:\n {df1}")

the dataframe is:
     name   class  math_score  english_score  gender  age  total_score
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
1    ami   first        -6.0            0.0  Female    7         -6.0
4  henry  second       -16.0          -20.0    Male    5        -36.0
0   alex   first        -6.0          -10.0    Male    4        -16.0

In [120]:
# Count() function
# lets count the total number of items in dataframe
# We will get the total number of elements in each column as follows
df1.count()

name             5
class            5
math_score       5
english_score    5
gender           5
age              5
total_score      5
dtype: int64

###  <font color = 'dodgerblue'> **head(), tail()**

In [121]:
# head(),tail()
# get the top 2 rows
print(f"the top 2 rows are \n {df1.head(2)}")

the top 2 rows are
     name   class  math_score  english_score  gender  age  total_score
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0

In [122]:
# gets the last 3 rows
print(f"\nthe last 3 rows are \n {df1.tail(3)}")

the last 3 rows are
     name   class  math_score  english_score  gender  age  total_score
1    ami   first        -6.0            0.0  Female    7         -6.0
4  henry  second       -16.0          -20.0    Male    5        -36.0
0   alex   first        -6.0          -10.0    Male    4        -16.0

###  <font color = 'dodgerblue'> **mean/median/std/var etc**

In [123]:
# mean, median,std,var methods
# it gives the mean  and median for each column if they are numerical
print(f"the mean of the data is \n{df1.mean()}")
print(f"\nthe median of the data is \n{df1.median()}")
print(f"\nthe standard deviation of the data is \n{df1.std()}")
print(f"\nthe variance of the data is \n{df1.var()}")

the mean of the data is
math_score       0.0
english_score    0.0
age              9.0
total_score      0.0
dtype: float64

the median of the data is
math_score      -6.0
english_score    0.0
age              7.0
total_score     -6.0
dtype: float64

the standard deviation of the data is
math_score       15.165751
english_score    15.811388
age               6.442049
total_score      30.495901
dtype: float64

the variance of the data is
math_score       230.0
english_score    250.0
age               41.5
total_score      930.0
dtype: float64

###  <font color = 'dodgerblue'> **describe()**

In [124]:
# We can also use describe() method to get all the descriptive statistics
print(f"the descriptive statistics  of the data is \n {df1.describe()}")

the descriptive statistics  of the data is
        math_score  english_score        age  total_score
count    5.000000       5.000000   5.000000     5.000000
mean     0.000000       0.000000   9.000000     0.000000
std     15.165751      15.811388   6.442049    30.495901
min    -16.000000     -20.000000   4.000000   -36.000000
25%     -6.000000     -10.000000   5.000000   -16.000000
50%     -6.000000       0.000000   7.000000    -6.000000
75%      4.000000      10.000000   9.000000    14.000000
max     24.000000      20.000000  20.000000    44.000000

###  <font color = 'dodgerblue'> **info()**

In [125]:
# we can get the information about the columns using df.info() method
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 2 to 0
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           5 non-null      object
 1   class          5 non-null      object
 2   math_score     5 non-null      float64
 3   english_score  5 non-null      float64
 4   gender         5 non-null      object
 5   age            5 non-null      int64
 6   total_score    5 non-null      float64
dtypes: float64(3), int64(1), object(3)
memory usage: 320.0+ bytes

###  <font color = 'dodgerblue'> **Applying functions along rows or columns**

In [126]:
df_score = df1.loc[:, ['math_score','english_score']]
df_score

   math_score  english_score
2         4.0           10.0
3        24.0           20.0
1        -6.0            0.0
4       -16.0          -20.0
0        -6.0          -10.0

In [127]:
# average score of each subject 
# axis = 0 : row sum for each column (subject)
df_score.mean(axis =0)

math_score       0.0
english_score    0.0
dtype: float64

In [128]:
# total score for each student
# axis = 1 - column sum for each row (student)
df_score.sum(axis=1)

2    14.0
3    44.0
1    -6.0
4   -36.0
0   -16.0
dtype: float64

In [129]:
# total score (sum of all the scores for all students)
df_score.sum().sum()

0.0

###  <font color = 'dodgerblue'> **value_counts(): count of unique values**

In [130]:
# Find number of males and females in the data
# value_counts give the count of unique values
# the gender column had two uniqie values - male and female
# value_count will give count of females and males
df1['gender'].value_counts()

Female    3
Male      2
Name: gender, dtype: int64

In [131]:
# we can get the percentage of each category by passing argument normalize = True
df1['gender'].value_counts(normalize = True)

Female    0.6
Male      0.4
Name: gender, dtype: float64

## <font color = 'dodgerblue'> **Grouping data**</font>
1. Aggregate functions helps us in understanding the data.
2. But sometimes we may require to apply these aggregate function to a group of data.
4.  Groupby mainly refers to a process involving one or more of the following steps:

  * Split : We split data into groups by applying some conditions on data.

  * Combine : We combine results from different groups.
**Syntax** :



```
  DataFrame.groupby().sum()
```
here, first we group the data based on condition inside the parethesis. 

Then it will take sum of the given grouped data.


Visual representation of a groupby operation
<img src="https://drive.google.com/uc?export=view&id=10khD_6G02Z624KRjhyCGuicodjhHRege" width="800"/>

In [132]:
df1

    name   class  math_score  english_score  gender  age  total_score
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
1    ami   first        -6.0            0.0  Female    7         -6.0
4  henry  second       -16.0          -20.0    Male    5        -36.0
0   alex   first        -6.0          -10.0    Male    4        -16.0

In [133]:
# group by function on the dataframe
# lets group students based on gender
df1.groupby('gender')

In [134]:
# Now lets apply mean() funtion to the grouped data
# It will return the mean of the items for each gender

df1.groupby('gender').mean()

        math_score  english_score   age  total_score
gender
Female    7.333333           10.0  12.0    17.333333
Male    -11.000000          -15.0   4.5   -26.000000

#### <FONT COLOR = 'dodgerblue'> **groupby with aggregate()**

* We are already familiar with the aggregations such as sum(), median(), std() etc.
* But we can use aggregate functions in group by which provides the flexibility to perform any kind of aggregation on the given data.


**Syntax** :


```
  DataFrame.aggregate(func, axis)

```
we can pass the required function and axis to apply the function.

In [135]:
print(f"My dataframe is: \n {df1}")

My dataframe is:
     name   class  math_score  english_score  gender  age  total_score
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
1    ami   first        -6.0            0.0  Female    7         -6.0
4  henry  second       -16.0          -20.0    Male    5        -36.0
0   alex   first        -6.0          -10.0    Male    4        -16.0

In [136]:
# lets group the data then apply aggregate function
# we want minimum and maximum value of each column for males and females
df1.groupby('gender').aggregate([min, max])

        name         class         math_score       english_score       age  \
         min    max    min     max        min   max           min   max min
gender
Female   ami  suzan  first  second       -6.0  24.0           0.0  20.0   7
Male    alex  henry  first  second      -16.0  -6.0         -20.0 -10.0   4

           total_score
       max         min   max
gender
Female  20        -6.0  44.0
Male     5       -36.0 -16.0

#### <FONT COLOR = 'dodgerblue'> **filter out groups using groupby and filter**

We can use filter with groupby() as well. This will allows us to drop or filter data based on the group properties.

**Example** :
We want to keep all the groups for whom the maximum value of total_score is greate than 0

In [137]:
# lets create a function

def filter_func(df):
  return df['total_score'].max() > 0

# now pass the function in filter function
# code here

In [138]:
# use lamda expression to get the same result
df1.groupby('gender').filter(lambda x: x['total_score'].max()>0)

    name   class  math_score  english_score  gender  age  total_score
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
1    ami   first        -6.0            0.0  Female    7         -6.0

<font color = 'red'> **Note:** </font> <font color = 'aqua'>   We get all the obsevations for the group for which the maximum value of total_score was greater than 70. The filter is applied at the group level.

## <font color = 'dodgerblue'> **Pivot Tables**
Pandas supports spreadsheet-like pivot tables that allow quick data summarization.

In [139]:
# let us get the mean  of total_score for each gender using groupby
df1.groupby('gender')[['total_score']].mean()

        total_score
gender
Female    17.333333
Male     -26.000000

In [140]:
# let us get the mean  of total_score for each gender in each class using groupby
df1.groupby(['gender','class'])[['total_score']].mean()

               total_score
gender class
Female first          -6.0
       second         29.0
Male   first         -16.0
       second        -36.0

In [141]:
# we can unstack the above results
df1.groupby(['gender','class'])[['total_score']].mean().unstack()

       total_score
class        first second
gender
Female        -6.0   29.0
Male         -16.0  -36.0

In [142]:
# This could be done more easily using pivot tables
# code here

In [143]:
# the default aggregate function is mean, we can easily change this to any otyher function
# code here

## <font color = 'dodgerblue'> **Combine Datasets: Merge and Join**
With Pandas we can use SQL-like joins on DataFrames. Pandas support various types of joins like: inner joins, left/right outer joins and full joins. We will now illustrate these below:

In [144]:
import pandas as pd
# Create dataframe
data = {'user_id':[1, 2, 3, 4, 5, 6, 7, 1, 2, 3],
       'item_id': [1, 2, 3, 1, 2, 4, 5, 6, 7, 8],
       'rating':  [1, 1, 5, 5, 4, 4, 4, 3, 2, 1]}
ratings = pd.DataFrame(data)

title_names = {'item_id': [2, 3, 4, 5, 6, 7, 8, 9, 10],
          'movie_names': ' B C D E F G H I J '.split(),
          }
          
movie_title = pd.DataFrame(title_names)

print(f'Ratings data\n{ratings}')
print(f'\nMovie Titles\n{movie_title}')

Ratings data
   user_id  item_id  rating
0        1        1       1
1        2        2       1
2        3        3       5
3        4        1       5
4        5        2       4
5        6        4       4
6        7        5       4
7        1        6       3
8        2        7       2
9        3        8       1

Movie Titles
   item_id movie_names
0        2           B
1        3           C
2        4           D
3        5           E
4        6           F
5        7           G
6        8           H
7        9           I
8       10           J

### <font color = 'dodgerblue'> **Merge-INNER JOIN**

In [145]:
# join data sets using merge
# code here

<font color = 'red'> **Note:** </font> <font color = 'aqua'>  Item_id 1, 9 and 10  were dropped because they don't exist in **both `DataFrame`s**. itemid 1 was missing from movie_title and item_id 9 amd 10 were not present in ratings dataframe This is the equivalent of a SQL `INNER JOIN`. If we want a `FULL OUTER JOIN`, where no item_id is dropped and `NaN` values are added, we should specify `how="outer"`:

### <font color = 'dodgerblue'> **Merge-OUTER JOIN**

In [146]:
all_titles = pd.merge(left=ratings, right=movie_title, on="item_id", how = 'outer')
all_titles

    user_id  item_id  rating movie_names
0       1.0        1     1.0         NaN
1       4.0        1     5.0         NaN
2       2.0        2     1.0           B
3       5.0        2     4.0           B
4       3.0        3     5.0           C
5       6.0        4     4.0           D
6       7.0        5     4.0           E
7       1.0        6     3.0           F
8       2.0        7     2.0           G
9       3.0        8     1.0           H
10      NaN        9     NaN           I
11      NaN       10     NaN           J

We can also use LEFT OUTER JOIN by setting how="left": only the movies present in the ratings DataFrame will appear in the result. Similarly, with how="right" only movies in the right DataFrame will appear in the result. Let us see example of LEFT OUTER JOIN

In [147]:
movies_with_ratings_only = pd.merge(left=ratings, right=movie_title, on="item_id", how = 'left')
movies_with_ratings_only

   user_id  item_id  rating movie_names
0        1        1       1         NaN
1        2        2       1           B
2        3        3       5           C
3        4        1       5         NaN
4        5        2       4           B
5        6        4       4           D
6        7        5       4           E
7        1        6       3           F
8        2        7       2           G
9        3        8       1           H

In [148]:
movies_with_title_info_only = pd.merge(left=ratings, right=movie_title, on="item_id", how = 'right')
movies_with_title_info_only

   user_id  item_id  rating movie_names
0      2.0        2     1.0           B
1      5.0        2     4.0           B
2      3.0        3     5.0           C
3      6.0        4     4.0           D
4      7.0        5     4.0           E
5      1.0        6     3.0           F
6      2.0        7     2.0           G
7      3.0        8     1.0           H
8      NaN        9     NaN           I
9      NaN       10     NaN           J

### <font color = 'dodgerblue'> **Merge - key column names are different**

In [149]:
movie_title_2 = movie_title.copy()
movie_title_2.columns = ["movie_id", "movie_names"]
movie_title_2

   movie_id movie_names
0         2           B
1         3           C
2         4           D
3         5           E
4         6           F
5         7           G
6         8           H
7         9           I
8        10           J

If the key column names differ, then we have to use  use left_on and right_on. For example:

In [150]:
pd.merge(left=ratings, right=movie_title_2, left_on="item_id", right_on="movie_id")

   user_id  item_id  rating  movie_id movie_names
0        2        2       1         2           B
1        5        2       4         2           B
2        3        3       5         3           C
3        6        4       4         4           D
4        7        5       4         5           E
5        1        6       3         6           F
6        2        7       2         7           G
7        3        8       1         8           H

## <font color = 'dodgerblue'>**Combine Datasets: Concat and Append**

Rather than joining DataFrames, we can just concatenate them using concat():

In [151]:
result_concat = pd.concat([ratings, movie_title])
result_concat

   user_id  item_id  rating movie_names
0      1.0        1     1.0         NaN
1      2.0        2     1.0         NaN
2      3.0        3     5.0         NaN
3      4.0        1     5.0         NaN
4      5.0        2     4.0         NaN
5      6.0        4     4.0         NaN
6      7.0        5     4.0         NaN
7      1.0        6     3.0         NaN
8      2.0        7     2.0         NaN
9      3.0        8     1.0         NaN
0      NaN        2     NaN           B
1      NaN        3     NaN           C
2      NaN        4     NaN           D
3      NaN        5     NaN           E
4      NaN        6     NaN           F
5      NaN        7     NaN           G
6      NaN        8     NaN           H
7      NaN        9     NaN           I
8      NaN       10     NaN           J

We can concatenate DataFrames horizontally instead of vertically by setting axis=1:

In [152]:
horizontal_concat = pd.concat([ratings, movie_title], axis =1)
horizontal_concat

   user_id  item_id  rating  item_id movie_names
0        1        1       1      2.0           B
1        2        2       1      3.0           C
2        3        3       5      4.0           D
3        4        1       5      5.0           E
4        5        2       4      6.0           F
5        6        4       4      7.0           G
6        7        5       4      8.0           H
7        1        6       3      9.0           I
8        2        7       2     10.0           J
9        3        8       1      NaN         NaN

However, this does not make sense, the concatenation was done using index values. The same item_id has different movie names. So we need to reindex the `DataFrame`s by item_id before concatenating:

In [153]:
horizontal_concat = pd.concat([ratings.set_index('item_id'), movie_title.set_index('item_id')], axis =1)

InvalidIndexError: Reindexing only valid with uniquely valued Index objects

We get error above because item_id is not uniqie in ratings dataframe.

In [156]:
# Create a new datafarne which has average rating for each movie
average_ratings = pd.DataFrame(ratings.groupby('item_id')['rating'].mean())
average_ratings

         rating
item_id
1           3.0
2           2.5
3           5.0
4           4.0
5           4.0
6           3.0
7           2.0
8           1.0

In [157]:
horizontal_concat = pd.concat([average_ratings, movie_title.set_index('item_id')], axis =1)
horizontal_concat

         rating movie_names
item_id
1           3.0         NaN
2           2.5           B
3           5.0           C
4           4.0           D
5           4.0           E
6           3.0           F
7           2.0           G
8           1.0           H
9           NaN           I
10          NaN           J

# <font color = 'dodgerblue'> **Saving and Loading Data**

In [158]:
df1

    name   class  math_score  english_score  gender  age  total_score
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
1    ami   first        -6.0            0.0  Female    7         -6.0
4  henry  second       -16.0          -20.0    Male    5        -36.0
0   alex   first        -6.0          -10.0    Male    4        -16.0

## <font color = 'dodgerblue'> **Saving Data**

In [162]:
# mount google drive
# so that we can save and load models/data from google drive

#from google.colab import drive
#drive.mount('/content/drive')

In [160]:
# library to navigate file system
from pathlib import Path

In [ ]:
# check current director
#!pwd

If we do not provide specific location, files are saved in current directory. When we close Google Colab, these files will be lost. Thus we should save files/models on google drive.

In [163]:
# here I have saved save my data to folder Data in my Google drive. /content/drive/MyDrive refers to 
# path where google drive is mounted. /teaching_fall_2022 is folder in my Google drive. 
# You should change this to folder you want to save data in your your Google drive

# specify pathlib folder
# This is a system Path(PosixPath)

data_folder = Path('/content/drive/MyDrive/teaching_fall_2022/ml-fall-2022/Lecture2_Numpy_Pandas')

We can construct a path to the file by joining the parts using the special operator /. The / can join several paths or a mix of paths and strings given, atleast one of those paths should be an instance of class Path from pathlib library (as shown below).

In [ ]:
file_csv = data_folder / "df_pd_ml_21.csv"
file_json = data_folder / "df_pd_ml_21.json"
df1.to_csv(file_csv)
df1.to_json(file_json)

In [ ]:
# check the content of the saved file
for filename in (file_csv, file_json):
    print("#", filename)
    with open(filename, "rt") as f:
        print(f.read())
        print()

# /content/drive/MyDrive/teaching_fall_2022/ml-fall-2022/Lecture2_Numpy_Pandas/df_pd_ml_21.csv
,name,class,math_score,english_score,gender,age,total_score
2,ross,second,4.0,10.0,Female,20,14.0
3,suzan,second,24.0,20.0,Female,9,44.0
1,ami,first,-6.0,0.0,Female,7,-6.0
4,henry,second,-16.0,-20.0,Male,5,-36.0
0,alex,first,-6.0,-10.0,Male,4,-16.0


# /content/drive/MyDrive/teaching_fall_2022/ml-fall-2022/Lecture2_Numpy_Pandas/df_pd_ml_21.json
{"name":{"2":"ross","3":"suzan","1":"ami","4":"henry","0":"alex"},"class":{"2":"second","3":"second","1":"first","4":"second","0":"first"},"math_score":{"2":4.0,"3":24.0,"1":-6.0,"4":-16.0,"0":-6.0},"english_score":{"2":10.0,"3":20.0,"1":0.0,"4":-20.0,"0":-10.0},"gender":{"2":"Female","3":"Female","1":"Female","4":"Male","0":"Male"},"age":{"2":20,"3":9,"1":7,"4":5,"0":4},"total_score":{"2":14.0,"3":44.0,"1":-6.0,"4":-36.0,"0":-16.0}}

## <font color = 'dodgerblue'> **Loading Data**

In [ ]:
df1_csv_loaded = pd.read_csv(file_csv, index_col=0)

In [ ]:
df1_csv_loaded

    name   class  math_score  english_score  gender  age  total_score
2   ross  second         4.0           10.0  Female   20         14.0
3  suzan  second        24.0           20.0  Female    9         44.0
1    ami   first        -6.0            0.0  Female    7         -6.0
4  henry  second       -16.0          -20.0    Male    5        -36.0
0   alex   first        -6.0          -10.0    Male    4        -16.0

In [ ]:
df1_json_loaded = pd.read_json(file_json)

In [ ]:
df1_json_loaded

    name   class  math_score  english_score  gender  age  total_score
2   ross  second           4             10  Female   20           14
3  suzan  second          24             20  Female    9           44
1    ami   first          -6              0  Female    7           -6
4  henry  second         -16            -20    Male    5          -36
0   alex   first          -6            -10    Male    4          -16